# ReIndexing

In [12]:
ser2=Series(['India','USA','Bhutan'],index=[1,5,10])
ser2

1      India
5        USA
10    Bhutan
dtype: object

In [13]:
ser2.reindex(np.arange(15))

0        NaN
1      India
2        NaN
3        NaN
4        NaN
5        USA
6        NaN
7        NaN
8        NaN
9        NaN
10    Bhutan
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [14]:
ser2.reindex(np.arange(15),method='ffill') #forward fill

0        NaN
1      India
2      India
3      India
4      India
5        USA
6        USA
7        USA
8        USA
9        USA
10    Bhutan
11    Bhutan
12    Bhutan
13    Bhutan
14    Bhutan
dtype: object

In [15]:
ser2.reindex(np.arange(15),method='bfill') #backward fill

0      India
1      India
2        USA
3        USA
4        USA
5        USA
6     Bhutan
7     Bhutan
8     Bhutan
9     Bhutan
10    Bhutan
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [16]:
ser2.reindex(np.arange(15),method='nearest') #best method

0      India
1      India
2      India
3        USA
4        USA
5        USA
6        USA
7        USA
8     Bhutan
9     Bhutan
10    Bhutan
11    Bhutan
12    Bhutan
13    Bhutan
14    Bhutan
dtype: object

In [29]:
df3=DataFrame(np.random.randint(1,50,16).reshape(4,4),columns=['C1','C2','C4','C5'],index=list('ABDE'))
df3

   C1  C2  C4  C5
A  19  19   2  19
B  24  35   3  11
D  46  48  16  20
E  43   5  22  46

In [31]:
df3.reindex(index=list('ABCDE'))

     C1    C2    C4    C5
A  19.0  19.0   2.0  19.0
B  24.0  35.0   3.0  11.0
C   NaN   NaN   NaN   NaN
D  46.0  48.0  16.0  20.0
E  43.0   5.0  22.0  46.0

In [32]:
df3.reindex(columns=['C1','C2','C3','C4','C5'])

   C1  C2  C3  C4  C5
A  19  19 NaN   2  19
B  24  35 NaN   3  11
D  46  48 NaN  16  20
E  43   5 NaN  22  46

In [33]:
df3.reindex(index=list('ABCDE'),columns=['C1','C2','C3','C4','C5'])

     C1    C2  C3    C4    C5
A  19.0  19.0 NaN   2.0  19.0
B  24.0  35.0 NaN   3.0  11.0
C   NaN   NaN NaN   NaN   NaN
D  46.0  48.0 NaN  16.0  20.0
E  43.0   5.0 NaN  22.0  46.0

## Droping Rows and Columns

In [34]:
df3.drop('B')

   C1  C2  C4  C5
A  19  19   2  19
D  46  48  16  20
E  43   5  22  46

In [35]:
df3

   C1  C2  C4  C5
A  19  19   2  19
B  24  35   3  11
D  46  48  16  20
E  43   5  22  46

In [36]:
df3.drop('B',inplace=True) #inplace is used for changing in original df

In [37]:
df3

   C1  C2  C4  C5
A  19  19   2  19
D  46  48  16  20
E  43   5  22  46

In [40]:
df3.drop('C2',axis=1) #axis =1 for selecting columns and by default it is 0 ie it is for row by default

   C1  C4  C5
A  19   2  19
D  46  16  20
E  43  22  46

In [42]:
df3.drop(columns='C2')

   C1  C4  C5
A  19   2  19
D  46  16  20
E  43  22  46

In [55]:
df4=DataFrame(np.arange(9).reshape(3,3),columns=['A','B','C'],index=['CSK','MI','KKR'])

In [45]:
df4

     A  B  C
CSK  0  1  2
MI   3  4  5
KKR  6  7  8

In [46]:
df4['A']

CSK    0
MI     3
KKR    6
Name: A, dtype: int32

In [48]:
df4[['A','B']] #passed list for multiple columns FOR FETCHING DATA

     A  B
CSK  0  1
MI   3  4
KKR  6  7

In [50]:
df4[1:3] #using slicing

     A  B  C
MI   3  4  5
KKR  6  7  8

# Grab by logic

In [51]:
df4>4 #gives boolean values for >4

         A      B      C
CSK  False  False  False
MI   False  False   True
KKR   True   True   True

In [52]:
df4[df4>4] #for displaying values which are true df name[condtion]

       A    B    C
CSK  NaN  NaN  NaN
MI   NaN  NaN  5.0
KKR  6.0  7.0  8.0

In [53]:
df4[df4['A']>4] #for checking condtion on particular column A

     A  B  C
KKR  6  7  8

In [62]:
ser4=Series(np.arange(1,7),index=list('ABCDEF'))

In [63]:
ser4

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int32

In [69]:
ser4[1:4:2]

B    2
D    4
dtype: int32

In [72]:
ser4['A']

1

In [79]:
ser4[ser4<4]

A    1
B    2
C    3
dtype: int32

In [77]:
ser4>3

A    False
B    False
C    False
D     True
E     True
F     True
dtype: bool